<?php
/**
 * Created by PhpStorm.
 * User: lashevskiy
 * Date: 22.07.2015
 * Time: 20:53
 */

namespace MainAppSpace;

require_once "Database.php";


$object = new Database("localhost" , "root" , "");

$object->createDatabase("BookStore");

$object->useDatabase("BookStore");

$object->createTable("Authors",
                    "isbn VARCHAR(32),
                    author VARCHAR(64),
                    INDEX (isbn(24)),
	                INDEX (author(32))",
                    "MyISAM");

$object->createTable("Books",
                    "isbn VARCHAR(32) NOT NULL,
                    title VARCHAR(64) NOT NULL COLLATE utf8_general_ci,
                    price FLOAT NOT NULL,
                    year YEAR,
                    pages SMALLINT UNSIGNED,
                    orderCount INT UNSIGNED DEFAULT 0,
                    releaseDate TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
                    description TEXT,
                    INDEX (isbn(24)),
                    INDEX (title (32)),
                    PRIMARY KEY(isbn)",
                    "MyISAM");

$object->createTable("BookCategory",
                    "isbn VARCHAR(32),
                    idCategory VARCHAR(16),
	                INDEX (isbn(24)),
	                INDEX (idCategory(16))",
                    "MyISAM");

$object->createTable("CategoryName",
                    "idCategory VARCHAR(16),
                    sName VARCHAR(32),
                    PRIMARY KEY(idCategory),
	                INDEX (sName(16))",
                    "MyISAM");

//TODO: из таблицы Books нужно вынести поле orderCount в отдельную таблицу. Аналогично и для releaseDate
/*$object->createTable("Orders",
                    "isbn VARCHAR(32),
                    orderCount INT UNSIGNED DEFAULT 0,
                    PRIMARY KEY(isbn)",
                    "MyISAM");*/

$object->createTable("Customers",
                    "custNo INT UNSIGNED AUTO_INCREMENT,
                    firstName VARCHAR(32),
                    lastName VARCHAR(32),
	                PRIMARY KEY (CustNo)",
                    "MyISAM");

$object->createTable("Purchases",
                    "custNo INT UNSIGNED UNIQUE,
	                isbn VARCHAR(24),
	                date DATETIME,
	                INDEX (custNo),
                    INDEX (isbn(20))",
                    "MyISAM");

$object->createTable("Users",
                    "custNo INT UNSIGNED NOT NULL AUTO_INCREMENT,
                    login VARCHAR(32) NOT NULL UNIQUE,
	                password CHAR(128) NOT NULL,
	                PRIMARY KEY (custNo),
                    INDEX (login(16))",
                    "MyISAM");

//$object->deleteDatabase("BookStore");

$object->queryMysql("
                      INSERT INTO
                          books(isbn, title, price, year, pages, description)
                      VALUES
                          ('978-5-496-00029-1', 'Управление проектами. 8-е изд.', 2109, 2014, 640, 'В последнем издании учебника известных американских ученых отражены все этапы проектирования, в том числе: интеграция проектной стратегии организации; определение цели проекта; разработка проектного плана; управление риском; сокращение времени исполнения проекта; календарное планирование ресурсов; лидерство и управление проектными командами; партнерство при проектировании; измерение, оценка и аудит состояния проектирования. 8-е издание отличается более последовательным стилем изложения материала, обновлениями некоторых глав и дополнительными примерами некоторых концепций, делающими их проще для понимания. Адресовано слушателям программ MBA, аспирантам, студентам и преподавателям, а также менеджерам всех уровней. Рекомендовано Советом Минобрнауки РФ по образовательной программе дополнительного профессионального образования «Мастер делового администрирования — Master of Business Administration (MBA)» в качестве учебника для слушателей, обучающихся по программам «Мастер делового администрирования».'),
                          ('978-5-496-00117-5', 'Финансовый менеджмент. Экспресс-курс. 7-е изд.', 1322, 2013, 592, 'Эта книга является одним из наиболее популярных учебников по современному финансовому менеджменту. Структура книги построена так, чтобы дать читателю возможность максимально уяснить логику взаимосвязи между управленческими решениями, влияющими на финансовое состояние предприятия, современной нормативной средой, в которой оно функционирует, и спектром экономических возможностей, доступных для финансового менеджера в этих условиях. Книга рассчитана на широкий круг специалистов по финансовому менеджменту и его приложениям. Она может служить прекрасным учебным пособием для студентов экономических вузов, желающих изучить наиболее продвинутые методы управления финансовыми ресурсами, а также для слушателей и преподавателей программ MBA финансово-управленческого профиля.'),
                          ('978-5-496-00088-8', 'Международный бизнес. 8-е изд.', 1204, 2013, 688, 'В книге профессора школы бизнеса Вашингтонского университета Чарльза Хилла «Международный бизнес: конкуренция на глобальном рынке» на многочисленных примерах рассматриваются основные тенденции развития мировой экономики, методы регулирования, исследования, прогнозирования и моделирования мирового рынка и международного бизнеса. К ее несомненным достоинствам стоит прежде всего отнести комплексность. Автор рассматривает широкий круг вопросов — от общестратегических до узкоспециальных, включая подробное описание «тонкой настройки» ключевых функций компании под специфику внешнеэкономической деятельности. Книга изобилует кейсами и практическими примерами, позволяющими связать сложные теоретические концепции и модели с практикой. Важно отметить, что Ч. Хилл детально анализирует мировой финансовый кризис 2008–2009 гг. и убедительно показывает, какие уроки должны быть извлечены из него компаниями, работающими за пределами своих внутренних рынков. Учебник выгодно отличается от подобных книг безупречной логикой и живой манерой изложения непростого материала. Потенциальная целевая аудитория издания представляется чрезвычайно широкой. В первую очередь книга рекомендуется студентам бакалавриата и магистратуры, обучающимся по управленческим и экономическим специальностям. Она может также оказаться полезной слушателям программ МВА и практикующим менеджерам, занимающимся в своих компаниях различными аспектами работы на внешних рынках.'),

                          ('978-5-496-01152-5', 'Oracle PL/SQL. Для профессионалов. 6-е изд.', 1640, 2014, 1024, 'Данная книга является подробнейшим руководством по языку PL/SQL, представляющему собой процедурное языковое расширение для SQL. В ней детально рассмотрены основы PL/SQL, структура программы, основные принципы работы с программными данными, а также методика применения операторов и инструкций для доступа к реляционным базам данных. Большое внимание уделяется вопросам безопасности, влиянию объектных технологий на PL/SQL и интеграции PL/SQL с XML и Java. За последние 18 лет, в течение которых переиздается эта книга, она стала незаменимым руководством по PL/SQL для сотен тысяч программистов, как начинающих, так и профессионалов. Шестое издание книги полностью обновлено под версию Oracle12c.'),
                          ('978-5-459-00346-8', 'Программирование с использованием Microsoft ASP.NET 4', 1639, 2012, 880, 'Эта книга представляет собой наиболее полное руководство по Microsoft ASP.NET, полностью переработанное под версию ASP.NET 4. Вы узнаете обо всех возможностях данной технологии, в частности об использовании тем, мастеров и шаблонов страниц, применении динамических данных для построения и настройки веб-приложений, а также о работе с Microsoft Silverlight и ASP.NET MVC. Особое внимание уделяется рассмотрению внутренних механизмов и конфигурации ASP.NET, jQuery, AJAX и паттернов проектирования.'),
                          ('978-5-496-01127-3', 'Философия Java. 4-е полное изд.', 1573, 2015, 1168, 'Впервые читатель может познакомиться с полной версией этого классического труда, который ранее на русском языке печатался в сокращении. Книга, выдержавшая в оригинале не одно переиздание, за глубокое и поистине философское изложение тонкостей языка Java считается одним из лучших пособий для программистов. Чтобы по-настоящему понять язык Java, необходимо рассматривать его не просто как набор неких команд и операторов, а понять его «философию», подход к решению задач, в сравнении с таковыми в других языках программирования. На этих страницах автор рассказывает об основных проблемах написания кода: в чем их природа и какой подход использует Java в их разрешении. Поэтому обсуждаемые в каждой главе черты языка неразрывно связаны с тем, как они используются для решения определенных задач.'),

                          ('978-5-91180-995-9', '100 популярных профессий. Психология успешной карьеры для старшеклассников и студентов', 97, 2009, 272, 'Книга поможет вам сориентироваться в мире современных профессий и выбрать для себя ту из них, которая будет отвечать вашим способностям и интересам, а также даст наилучшие возможности для построения карьеры и для достойных заработков. Вы познакомитесь с описанием ста наиболее популярных профессий. Основной акцент будет сделан на распространившихся недавно и популярных среди современной молодежи профессиях: веб-дизайнер, логистик, мерчендайзер, маркетолог, специалист по рекламе и т.п. Кроме описания профессий, в книге даются и психологические механизмы их выбора. Адресована она старшеклассникам, их родителям и всем тем, кто заинтересован в профессиональном самоопределении; полезна она будет также психологам и педагогам, работающим с молодежью.'),
                          ('978-5-49807-595-2', '22 урока идеальной грамотности', 54, 2010, 208, 'Наталья Романова — филолог, нейрофизиолог, руководитель и автор курса Школы грамотности Романовых — представляет курс «Без правил». Эта альтернативная программа практической грамотности действует с 1992 года. Она позволяет всего за 10 занятий научиться уверенно писать без ошибок. Русский язык без заучивания правил и использования словарей? С программой «Без правил» это возможно! Курс предельно прост и эффективен, решает все проблемы с грамотностью, стоящие перед школьниками и абитуриентами, включая успешную сдачу ЕГЭ. Это настоящий прорыв, освобождение из карцера нормативной грамматики, где люди мучительно проводят свои школьные годы!'),
                          ('978-5-496-00833-4', '505 самых важных английских фраз. Готовые шаблоны и конструкции (29 карточек)', 89, 2013, 29, 'Любите путешествовать, но не владеете языками? Не любите разговорники, так как в критической ситуации никак не найти нужную фразу? На помощь придут карточки — самый быстрый и удобный способ общения! Готовые шаблоны помогут вам быстро сориентироваться в сложной ситуации в чужой стране и моментально найти нужную фразу, чтобы позвать на помощь, сообщить о преступлении или просто без проблем купить понравившееся платье!'),

                          ('978-5-496-00464-0', '1917. Разгадка русской революции', 272, 2014, 416, 'Гибель Российской империи в 1917 году не была случайностью, как не случайно рассыпался и Советский Союз. В обоих случаях мощная внешняя сила инициировала распад России, используя подлецов и дураков, которые за деньги или красивые обещания в итоге разрушили свою собственную страну. История этой величайшей катастрофы до сих пор во многом загадочна, и вопросов здесь куда больше, чем ответов. Германия, на которую до сих пор возлагают вину, была не более чем орудием, а потом точно так же стала жертвой уже своей революции. Февраль 1917-го – это начало русской катастрофы ХХ века, последствия которой были преодолены слишком дорогой ценой. Но когда мы забыли, как геополитические враги России разрушили нашу страну, - ситуация распада и хаоса повторилась вновь. И в том и в другом случае эта сила прикрывалась фальшивыми одеждами союзничества и общечеловеческих ценностей. Вот и сегодня их «идейные» потомки, обильно финансируемые из-за рубежа, вновь готовы спровоцировать в России революцию. '),
                          ('978-5-49807-600-3', '2012 год. Версии и факты', 104, 2010, 192, 'Почему в последнее время 2012 год все чаще называют датой будущего Армагеддона? О чем говорят пророчества жрецов майя, средневекового алхимика Нострадамуса, болгарской предсказательницы Ванги? Какие реальные опасности для всего живого уже встречались в истории нашей планеты и что еще ожидает Землю в ближайшие годы? Все эти непростые вопросы автор рассматривает сквозь призму современных научных знаний, анализируя многие спорные теории будущего Земли. На страницах книги читатели встретятся с гипотезами о грядущем ледниковом периоде и узнают последние новости о вспышках на Солнце, оценят мощь древних супервулканов и непредсказуемость астероида Апофиз, осознают разрушительный потенциал грандиозного эксперимента с Большим адронным коллайдером.'),
                          ('978-5-496-01625-4', 'Единый учебник истории России с древних времен до 1917 года. С предисловием Николая Старикова', 331, 2015, 512, 'Единой стране — Единый учебник истории! Необходимость такого учебника на сегодняшний день очевидна всем, кроме … министра образования. Несмотря на требование президента, Единого учебника истории до сих пор нет. Сложная работа? Безусловно. Но она уже была сделана. Ведь учебники истории были и в СССР, и в Российской империи, и если первые можно заподозрить в излишней идеологичности, то вторые несли только одну идеологию — сильной сверхдержавы, огромной и единой страны. Не надо выдумывать велосипед. Учебники истории уже написаны нашими предками. Один из лучших — учебник профессора Сергея Федоровича Платонова.'),

                          ('978-5-388-00663-9', 'Оториноларингология: Руководство. Том 1', 650, 2009, 832, 'Перед вами первый том двухтомного руководства по оториноларингологии. В руководстве изложены сведения об эмбриогенезе, анатомии, физиологии, методах исследования, симптоматике, клиническом течении, диагностике и дифференциальной диагностике, лечении и профилактике заболеваний носа и околоносовых пазух, глотки, пищевода, гортани и трахеи в историческом и современном аспектах. Особое внимание уделено проявлениям в ЛОР-органах инфекционных, в том числе и специфических, болезней. Широко представлены сведения по онкологии ЛОР-органов, их травматизму, инородным телам, мальформациям, а также различного рода осложнениям гнойных заболеваний. Описаны наиболее распространенные хирургические пособия при гнойных процессах ЛОР-органов, а также методы реконструктивной хирургии, в том числе и методы слухоулучшающих оперативных вмешательств. Существенное внимание уделено отечественной и зарубежной истории оториноларингологии. Издание предназначено для оториноларингологов, неврологов, нейрохирургов, стоматологов и офтальмологов.'),
                          ('978-5-459-00510-3', 'Оториноларингология: Учебник для вузов', 478, 2011, 640, 'Учебник содержит подробные сведения об основных периодах развития отечественной и мировой оториноларингологии, клинической анатомии и физиологии, методах исследования, симптомах, клиническом течении, лечении и профилактике рутинных, травматических и профессиональных заболеваний ЛОР-органов. Изложены вопросы оказания неотложной помощи при острых заболеваниях и травмах ЛОР-органов, приведены примеры классических хирургических методов лечения, а также данные по осложнениям гнойных заболеваний ЛОР-органов. Существенное внимание уделено наиболее актуальным вопросам детской оториноларингологии, а также профессиональным болезням ЛОР-органов. Издание адресовано студентам медицинских вузов и молодым специалистам соответствующего профиля.'),
                          ('978-5-496-00018-5', 'Современные хирургические инструменты. 2-е изд.', 380, 2012, 352, 'Во втором издании практического пособия (предыдущее вышло в 2006 г.) исчерпывающим образом описаны разнообразные хирургические инструменты и особенности их применения в современной клинической практике. Максимально информативная, эта книга станет незаменимым помощником для широкого круга специалистов хирургического профиля, а также для студентов старших курсов медицинских вузов.'),

                          ('978-5-496-00046-8', 'Дифференциальные уравнения математической физики в электротехнике', 381, 2012, 352, 'Учебное пособие соответствует требованиям государственных образовательных стандартов ВПО по направлениям подготовки дипломированных специалистов.'),
                          ('978-5-459-00290-4', 'Краткий справочник машиностроителя-международника', 220, 2011, 384, 'Цель данной книги – ввести российского инженера-механика в незнакомый для него мир американского и западноевропейского машиностроения и помочь ему ориентироваться в этом мире. Это первый справочник на русском языке, полностью построенный на технических сведениях, информации и стандартах по машиностроению, используемых на Западе. Упор сделан на американские и германские стандарты. При составлении справочника автор использовал материалы из американских, европейских и японских справочников и учебных пособий, информацию из промышленных каталогов, сведения из Интернета. Основная часть информации представлена параллельно в метрической и дюймовой системе мер. Часть терминов снабжена переводом на английский язык.'),
                          ('978-5-496-00934-8', 'Нормативные требования и практические рекомендации при проектировании котельных', 265, 2013, 144, 'Книга представляет собой справочное пособие по проектированию котельных с использованием отопительного оборудования компании Viessmann. Издание построено в формате практических рекомендаций и ответов на вопросы, возникающие при учете нормативных требований и работе с регламентирующими документами при проектировании котельных установок. Пособие адресовано действующим инженерам, а также студентам вузов.'),

                          ('978-5-496-00583-8', '100 ловушек в личной жизни. Как их распознать и обойти', 99, 2014, 208, 'Как дела в личной жизни? Вопрос, который у кого-то вызывает улыбку, у кого-то – оторопь, а других от него бросает в жар. Доктор психологических наук Сергей Петрушин раскрывает нам все тайны личной жизни. Убедительно и ненавязчиво он подсказывает читателю, как найти свою вторую половинку и построить счастливые и здоровые любовные отношения, избегая ловушек и прокладывая себе ровную дорогу в будущее.'),
                          ('978-5-496-00556-2', '100 самых популярных трюков в общении', 78, 2013, 176, 'Вам приходилось когда-либо чувствовать, что собеседник вас провел? Может быть, он блефовал или сыграл на ваших чувствах, запугал вас или «взял на слабо»? В современном обществе, как в бизнесе, так и в повседневном общении, такие трюки практикуются сплошь и рядом. Их используют предприимчивые консультанты по продажам, чтобы втюхать вам ненужные товары и услуги, нечистоплотные политики, прорывающиеся к кормушке, борющиеся за место под солнцем коллеги, ложные друзья, которые ищут выгоды от общения с вами. Вам надоело быть доверчивым бессребреником, вечно попадающимся в расставленные хитрецами ловушки? Эта книга научит вас легко распознавать любые нечестные ходы собеседников и, главное, давать им достойный отпор. Даже отъявленные специалисты в области грязных трюков не смогут вас провести!'),
                          ('978-5-496-00394-0', 'Эмоции и чувства. 2-е изд.', 499, 2013, 784, 'Второе издание учебного пособия (предыдущее вышло в 2001 г.) переработано и дополнено. В книге изложены теоретические и методологические вопросы изучения эмоций и чувств человека. Основное внимание уделено анализу структуры эмоциональной сферы и ее составляющих: эмоционального тона, эмоций, эмоциональных свойств личности, чувств, эмоциональных типов. Рассмотрены теории возникновения эмоций, их функции и роль в жизни человека, изменения эмоциональной сферы в онтогенезе и при патологии. В пособии приведены многочисленные методики изучения различных компонентов эмоциональной сферы человека, которые могут с успехом использоваться как в научных, так и практических целях. Научное содержание почти всех глав второго издания расширено с учетом отечественных и зарубежных исследований, опубликованных за последние 15 лет. Учебное пособие предназначено для психологов, психофизиологов, педагогов, а также для студентов и аспирантов психологических и педагогических факультетов и вузов.'),

                          ('978-5-389-07435-4', 'Гарри Поттер и Философский камень', 362, 2014, 432, 'Одиннадцатилетний мальчик-сирота Гарри Поттер живет в семье своей тетки и даже не подозревает, что он - настоящий волшебник. Но однажды прилетает сова с письмом для него, и жизнь Гарри Поттера изменяется навсегда. Он узнает, что зачислен в Школу Чародейства и Волшебства, выясняет правду о загадочной смерти своих родителей, а в результате ему удается раскрыть секрет философского камня.'),
                          ('978-5-389-07781-2', 'Гарри Поттер и Тайная комната', 345, 2014, 480, 'В Школе чародейства и волшебства Хогвартс происходят тревожные события. Кто-то нападает на учеников школы, и преподаватели подозревают, что это таинственное чудовище, которое скрывается в легендарной Тайной комнате. Гарри Поттер и его друзья разгадывают загадку Тайной комнаты, и теперь Гарри снова предстоит сразиться с Лордом Волан-де-Мортом. Сумеет ли он победить на этот раз?'),
                          ('978-5-389-07788-1', 'Гарри Поттер и узник Азкабана', 315, 2015, 528, 'Двенадцать долгих лет в Азкабане - мрачной тюрьме волшебного мира - содержался всем известный узник по имени Сириус Блэк. Его обвиняли в убийстве тринадцати человек и считали наследником Лорда Волан-де-Морта. И вот он бежал, и из оставленных им следов ясно, что на этот раз убийца поставил целью избавиться от Гарри Поттера. Теперь Гарри Поттер в опасности, даже за стенами своей волшебной школы, даже в окружении друзей - потому что среди них есть предатель, готовый открыть убийце путь в Хогвартс.'),
                          ('978-5-389-07789-8', 'Гарри Поттер и Кубок Огня', 369, 2015, 704, 'Гарри Поттеру предстоит четвертый год обучения в Школе чародейства и волшебства в Хогвартсе. Новые заклинания, новые зелья, новые учителя, новые предметы... Все это знакомо, и Гарри с нетерпением ожидает начала учебного года. Но на школу внезапно обрушивается Турнир Трех Волшебников, и, конечно же, каждый хочет принять в нем участие...'),
                          ('978-5-389-07790-4', 'Гарри Поттер и Орден Феникса', 503, 2014, 892, 'Гарри Поттер с нетерпением ждет окончания каникул и начала пятого учебного года в Хогвартсе. Юный волшебник как никогда страдает от одиночества, а насмешки и придирки Дурслей стали совсем невыносимы. К тому же он уверен, что Волан-де-Морт возродился и скоро начнет действовать. Вас снова ждут опасные и захватывающие приключения, жестокая борьба, верные друзья и волшебный мир Гарри Поттера.'),
                          ('978-5-389-07791-1', 'Гарри Поттер и Принц-полукровка', 429, 2015, 672, 'Министерство магии терпит поражение за поражением в битвах с Волан-де-Мортом. Даже маглы страдают от второй войны - каждый день происходят катастрофы, причины которых никому не ведомы. Но и на войне жизнь продолжается. Гарри, Рон и Гермиона, как и все шестнадцатилетние, учатся, ходят на вечеринки и влюбляются. Однако опасность все ближе. Несмотря на все усилия Дамблдора по защите школы, в Хогвартсе происходят очень странные события. Омут памяти на этот раз откроет Гарри самую большую тайну Темного Лорда, и ради того, чтобы победить, Гарри вынужден пожертвовать самым дорогим... Какую сторону в этой войне примет загадочный Принц-полукровка?'),
                          ('978-5-389-07792-8', 'Гарри Поттер и Дары Смерти', 420, 2015, 704, 'Гарри Поттера ждет самое страшное испытание в жизни - смертельная схватка с Волан-де-Мортом. Ждать помощи не от кого - Гарри одинок как никогда. Друзья и враги Гарри предстают в совершенно неожиданном свете. Граница между добром и злом становится все призрачнее... В седьмой, финальной книге Дж.К.Ролинг раскрывает все магические тайны.'),

                          ('978-5-496-01223-2', 'Визуальный словарь архитектурных стилей', 1249, 2014, 224, 'Мировая культура невозможна без представления об основных архитектурных стилях. Каждый хоть раз слышал о классицизме или барокко, однако не всегда бывает легко определить, к какому стилю следует отнести то или иное здание, тем более дать объяснение, что представляет собой стиль как таковой. Эта книга позволит развеять сомнения и увидеть на конкретных, представленных великолепными фотографиями, примерах основные характеристики стилей европейской архитектуры от доисторических времен до наших дней.'),
                          ('978-5-906417-70-1', 'Универсальные методы дизайна', 1013, 2013, 208, 'Брюс Ханингтон, профессор прикладного дизайна Университета Карнеги (США), и известный практикующий дизайнер и консультант Белла Мартин собрали в этой книге 100 наиболее популярных и эффективных методов создания высококачественных дизайнерских работ, без которых не обойтись ни одному современному дизайнеру, в какой бы сфере он ни применял свое мастерство. Авторы подробно описывают каждую методику, рассказывают о том, как она была применена впервые, и приводят наиболее удачные примеры ее использования. Прекрасные фотографии наглядно иллюстрируют каждую концепцию. Книга предназначена как для студентов, изучающих дизайн, так и для практикующих специалистов.'),
                          ('978-5-459-00837-1', 'Жизнь Петербурга в иллюстрациях городских газет. Конец XIX — начало XX в.', 300, 2011, 128, 'Книга впервые открывает мир газетной иллюстрации начала XX в. – огромный пласт изобразительных материалов, до сих пор никем просто не замеченный.'),

                          ('978-5-496-01816-6', 'Билеты для экзамена в ГИБДД с комментариями. Категории С и D', 260, 2015, 208, 'Представляем вашему вниманию новую редакцию билетов для экзаменов в ГИБДД, со всеми последними изменениями. Ответы на вопросы сопровождаются комментариями, что поможет вам не просто вызубрить билеты, но и вникнуть в смысл приведенных в них ситуаций. Данная книга рекомендована порталом avtotut.ru'),
                          ('978-5-49807-261-6', 'Оружие против ГИБДД. Личный юрист водителя', 71, 2010, 224, 'Зачастую мы несем ответственность только потому, что не знаем своих прав. Но право на защиту человек имеет, даже если умышленно нарушил правила дорожного движения. В эту книгу вложен многолетний авторский опыт защиты прав водителей. Вам больше не придется прибегать к взяткам или становиться жертвой произвола сотрудников ДПС, ведь любой вопрос можно решить законным путем!'),
                          ('978-5-94807-032-2', 'Покраска автомобиля и кузовные работы (+СD с видеокурсом)', 139, 2012, 192, 'Ни один автомобиль не застрахован от повреждений. И чем дольше длится эксплуатация, тем больше накапливается мелких, а иногда и не очень мелких неприятностей — начиная со ржавчины, «съедающей» арки колеса, и заканчивая «уводом» автомобиля в сторону и сложностями в управлении. Многие проблемы связаны с нарушениями геометрии кузова, но еще больше — с повреждением лакокрасочного покрытия. Прочитав эту книгу, вы узнаете, как можно восстановить лакокрасочное покрытие, избавиться от трещин, царапин и мелких сколов. Вы также узнаете о том, в чем заключаются кузовные работы и как их можно выполнять самостоятельно. И даже если вы не захотите лично восстанавливать форму кузовных деталей или красить автомобиль, то сможете эффективно проконтролировать работу мастера автосервиса. Книга рекомендована интернет-порталом www.avtotut.ru.'),

                          ('978-5-94807-023-0', 'Налоговое право. Краткий курс. 2-е изд.', 87, 2010, 224, 'Настоящее пособие написано в соответствии с программой курса «Налоговое право». Автор рассматривает базовые аспекты налогообложения (терминология, методы, принципы), основы налогового права, международного налогового права, налогового планирования, правовое регулирование налогообложения. Особое внимание уделено организации налогового производства и контроля, привлечению к ответственности за нарушение законодательства о налогах и сборах, защите интересов налогоплательщиков. В разрезе элементов налогообложения рассматривается порядок исчисления и уплаты российских налоговых платежей (федерального, регионального, местного уровней), дается характеристика специальных налоговых режимов. Пособие предназначено для студентов высших и средних учебных заведений, изучающих курс «Налоговое право», а также будет полезно преподавателям, аспирантам и всем интересующимся вопросами налогового права.'),
                          ('978-5-459-00593-6', 'Полный юридический справочник владельца квартиры, агента по недвижимости, покупателя жилья', 169, 2011, 400, 'Справочник предназначен для всех граждан Российской Федерации, которые проживают в собственных или съемных жилых помещениях; граждан, которые собираются улучшить или изменить свои жилищные условия: купить, продать или обменять дом, квартиру или комнату; работников единых информационно-расчетных центров, товариществ собственников жилья, жилищно-эксплуатационных контор, членов жилищных, жилищно-строительных и других специализированных кооперативов; на работников управляющих компаний и организаций.'),
                          ('978-5-49807-621-8', 'Справочник по трудовому законодательству работника и работодателя. 4-е изд. (+СD)', 214, 2010, 416, 'Предлагаемый справочник знакомит с трудовым законодательством Российской Федерации. Книга содержит отдельный перечень всех использованных правовых актов с указанием последней редакции, а также алфавитный указатель и подробное содержание, которые способствуют быстрому поиску необходимой информации. Приведенная в них информация имеет ссылку на соответствующий нормативный правовой акт и примечание автора. Для удобства пользователей к изданию прилагается компакт-диск с нормативными правовыми актами, регулирующими трудовые отношения в Российской Федерации по состоянию на 01.11.2009 г. с учетом изменений на 01.01.2010 г. (490 документов). В 4-е издание включены вопросы трудоустройства, предоставления государственных услуг в сфере занятости населения. Справочник предназначен для специалистов в области трудового законодательства, руководителей всех уровней, индивидуальных предпринимателей и наемных работников, будет полезен студентам и преподавателям экономических и юридических специальностей.'),

                          ('978-5-496-00652-1', 'Невский проспект', 420, 2013, 304, 'С самого начала создания Невский проспект как будто бы вышел из повиновения своих создателей, разрушая их замыслы и живя самостоятельной жизнью. Должен был быть прямым, как стрела, а изогнулся в том месте, где соединялся с нынешним Лиговским проспектом. Должен был стать лишь дорогой к центру города – Васильевскому острову, но сам с течением времени превратился в центр, артерию Петербурга. Великие ученые, гениальные поэты и художники, городские сумасшедшие, философы, артисты – все обитали здесь. Неповторимый дух Невского до сих пропитывает весь город и создает собственную, неповторимую петербургскую ауру. Новая книга Инны Соболевой проведет читателя по Невскому проспекту от Адмиралтейства до Александро-Невской лавры и расскажет множество удивительных историй о домах и людях, чьи судьбы навсегда оказались связаны с величественным, всемогущим Невским. '),
                          ('978-5-496-00894-5', 'Неформальный Петербург. Путеводитель по культовым местам', 286, 2015, 160, 'Автор родился в Ленинграде, живет в Петербурге, работает в Питере. Такая цепь совпадений рано или поздно должна была привести к чему-нибудь исключительно петербургскому. И привела – к рождению самого необычного путеводителя по Петербургу, который вы когда-либо видели! Уникальный, совершенно неформальный путеводитель по живому, непарадному, нескучному Петербургу. Открывает город с новой, необычной стороны. Здесь то, чего нет в путеводителях, о чем не рассказывают на экскурсиях. Это дружеская прогулка с человеком, который знает и любит свой город. И даже про Купчино может рассказать так, что там хочется навеки поселиться)))'),
                          ('978-5-496-00489-3', 'Санкт-Петербург. Путеводитель по местам, где сбываются мечты. St.Petersburg. Wishes Guidebook', 324, 2013, 129, 'Перед вами необычный путеводитель: он расскажет вам о волшебных и таинственных уголках Санкт-Петербурга, где сбываются самые сокровенные желания. Вы узнаете, какие памятники славятся способностью исполнять мечты, а также о том, что нужно сделать, чтобы желание сбылось непременно. Иногда, чтобы мечта осуществилась, необходимо совершить определенный ритуал. Если вы хотите побывать в этих местах и испытать магию Петербурга на себе - приглашаю в путешествие! Бросьте монету коту Елисею, потрите нос фотографу, подержите грифона за правый зуб - и ваши желания сбудутся, и хорошее настроение вам будет обеспечено!')
                    ");

$object->queryMysql("
                    INSERT INTO
                        authors(isbn, author)
                    VALUES
                        ('978-5-496-00029-1', 'Мередит Д. Р.'),
                        ('978-5-496-00029-1', 'Мантел, мл. С. Д.'),
                        ('978-5-496-00117-5', 'Бригхэм Ю. Ф.'),
                        ('978-5-496-00117-5', 'Хьюстон Д. А.'),
                        ('978-5-496-00088-8', 'Хилл Ч. В.'),

                        ('978-5-496-01152-5', 'Фейерштейн С.'),
                        ('978-5-496-01152-5', 'Прибыл Б.'),
                        ('978-5-459-00346-8', 'Эспозито Д.'),
                        ('978-5-496-01127-3', 'Эккель Б.'),

                        ('978-5-91180-995-9', 'Грецов А. Г.'),
                        ('978-5-91180-995-9', 'Бедарева Т. А.'),
                        ('978-5-49807-595-2', 'Романова Н. В.'),
                        ('978-5-496-00833-4', 'Трофименко Т. Г.'),

                        ('978-5-496-00464-0', 'Стариков Н. В.'),
                        ('978-5-49807-600-3', 'Панин В'),
                        ('978-5-496-01625-4', 'С. Платонов'),

                        ('978-5-388-00663-9', 'Бабияк В. И.'),
                        ('978-5-388-00663-9', 'Говорун М. И.'),
                        ('978-5-388-00663-9', 'Накатис Я. А.'),
                        ('978-5-459-00510-3', 'Бабияк В. И.'),
                        ('978-5-459-00510-3', 'Говорун М. И.'),
                        ('978-5-459-00510-3', 'Накатис Я. А.'),
                        ('978-5-459-00510-3', 'Пащинин А. Н.'),
                        ('978-5-496-00018-5', 'Семенов Г. М.'),

                        ('978-5-496-00046-8', 'Аполлонский С. М.'),
                        ('978-5-459-00290-4', 'Цвияк А. П.'),
                        ('978-5-496-00934-8', 'Палей Е. Л.'),

                        ('978-5-496-00583-8', 'Петрушин С. В.'),
                        ('978-5-496-00556-2', 'Лионов П. Ф.'),
                        ('978-5-496-00394-0', 'Ильин Е. П.'),

                        ('978-5-389-07435-4', 'Джоан Кэтлин Роулинг'),
                        ('978-5-389-07781-2', 'Джоан Кэтлин Роулинг'),
                        ('978-5-389-07788-1', 'Джоан Кэтлин Роулинг'),
                        ('978-5-389-07789-8', 'Джоан Кэтлин Роулинг'),
                        ('978-5-389-07790-4', 'Джоан Кэтлин Роулинг'),
                        ('978-5-389-07791-1', 'Джоан Кэтлин Роулинг'),
                        ('978-5-389-07792-8', 'Джоан Кэтлин Роулинг'),

                        ('978-5-496-01223-2', 'Хопкинс О.'),
                        ('978-5-906417-70-1', 'Мартин Б.'),
                        ('978-5-906417-70-1', 'Ханингтон Б.'),
                        ('978-5-459-00837-1', 'Ансберг О. Н.'),

                        ('978-5-496-01816-6', 'Шельмин Е. В.'),
                        ('978-5-49807-261-6', 'Шельмин Е. В.'),
                        ('978-5-49807-261-6', 'Резниченко А.'),
                        ('978-5-94807-032-2', 'Громаковский А. А.'),
                        ('978-5-94807-032-2', 'Бранихин Г.'),

                        ('978-5-94807-023-0', 'Викторова Н. Г.'),
                        ('978-5-459-00593-6', 'Бирюков Б. М.'),
                        ('978-5-49807-621-8', 'Щуко Л. П.'),

                        ('978-5-496-00652-1', 'Соболева И. А.'),
                        ('978-5-496-00894-5', 'Жданова М. А.'),
                        ('978-5-496-00489-3', 'Кулеша В. И.')
                    ");

$object->queryMysql("
                    INSERT INTO
                        bookcategory (isbn, idCategory)
                    VALUES
                        ('978-5-496-00029-1', 0),
                        ('978-5-496-00117-5', 0),
                        ('978-5-496-00088-8', 0),

                        ('978-5-496-01152-5', 1),
                        ('978-5-459-00346-8', 1),
                        ('978-5-496-01127-3', 1),

                        ('978-5-91180-995-9', 2),
                        ('978-5-49807-595-2', 2),
                        ('978-5-496-00833-4', 2),

                        ('978-5-496-00464-0', 3),
                        ('978-5-49807-600-3', 3),
                        ('978-5-496-01625-4', 3),

                        ('978-5-388-00663-9', 4),
                        ('978-5-459-00510-3', 4),
                        ('978-5-496-00018-5', 4),

                        ('978-5-496-00046-8', 5),
                        ('978-5-459-00290-4', 5),
                        ('978-5-496-00934-8', 5),

                        ('978-5-496-00583-8', 6),
                        ('978-5-496-00556-2', 6),
                        ('978-5-496-00394-0', 6),

                        ('978-5-389-07435-4', 7),
                        ('978-5-389-07781-2', 7),
                        ('978-5-389-07788-1', 7),
                        ('978-5-389-07789-8', 7),
                        ('978-5-389-07790-4', 7),
                        ('978-5-389-07791-1', 7),
                        ('978-5-389-07792-8', 7),

                        ('978-5-496-01223-2', 8),
                        ('978-5-906417-70-1', 8),
                        ('978-5-459-00837-1', 8),

                        ('978-5-496-01816-6', 9),
                        ('978-5-49807-261-6', 9),
                        ('978-5-94807-032-2', 9),

                        ('978-5-94807-023-0', 10),
                        ('978-5-459-00593-6', 10),
                        ('978-5-49807-621-8', 10),

                        ('978-5-496-00652-1', 11),
                        ('978-5-496-00894-5', 11),
                        ('978-5-496-00489-3', 11)
                    ");

$object->queryMysql("
                    INSERT INTO
                        CategoryName (idCategory, sName)
                    VALUES
                        (0, 'Бизнес литература'),
                        (1, 'Компьютерная литература'),
                        (2, 'Наука и образование'),
                        (3, 'Публицистика и история'),
                        (4, 'Медицинская литература'),
                        (5, 'Техническая литература'),
                        (6, 'Психология'),
                        (7, 'Детская литература. Игры'),
                        (8, 'Искусство и культура'),
                        (9, 'Автомобили. ПДД'),
                        (10, 'Юридическая литература'),
                        (11, 'Путешествия. Туризм')
                    ");
